Revit 2024 API
MacroManager Properties
The MacroManager type exposes the following members.
Properties
Name | Description
Count
 The count.
Folder
 The modules folder. The path for document macros will not persist except while the document is loaded in this session.
IsEnabled
 Indicates if macros stored in this MacroManager are enabled.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroLevel
 The Macro level.
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace